docs/posts/2015-01-13-the-ninth-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 25, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Ninth Sunday After Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Ninth Sunday After Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
When we discuss the concept of rights in political philosophy, I confess that I feel conflicted. On one hand, the recognition of, and commitment to, the rights of others is essential to treating them with the dignity that is due to one created in the image of God. On the other hand, the constant practice of demanding my own rights does not seem consistent with the claim to follow the one that Paul described in Philippians 2:
</p>


<blockquote>
<p>
Let the same mind be in you that was in Christ Jesus,<br>
who, though he was in the form of God,<br>
did not regard equality with God<br>
as something to be exploited,<br>
but emptied himself,<br>
taking the form of a slave,<br>
being born in human likeness.<br>
And being found in human form,<br>
he humbled himself<br>
and became obedient to the point of death—<br>
even death on a cross.
</p>
</blockquote>

<p>
Philippians 2:6-8 (NRSV)
</p>

<p>
So, yesterday&rsquo;s sermon on entitlement by Mitch Randall at [NorthHaven Church](<a href="http://northhavenchurch.net">http://northhavenchurch.net</a> ) was particularly convicting. Here is the prayer that it prompted:
</p>

<p>
<i>The petty heart</i><br>
<i>feels entitled to everything,</i><br>
<i>and finds grace in nothing.</i><br>
</p>

<p>
<i>Blessed is the one</i><br>
<i>who feels entitled to nothing,</i><br>
<i>but finds grace in everything.</i>
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 25, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
